messages = {
    'ru': {
        'welcome': "Добро пожаловать! 😊\n\nМы рады помочь вам в решении ваших вопросов и проблем...",
        'select_language': "🌐 Выбрать язык",
        'enter_fullname': "Пожалуйста, введите ваше полное имя: 👤",
        'enter_group': "Укажите, в какой группе вы находитесь: 🏷️",
        'describe_problem': "Опишите вашу проблему: 📝",
        'describe_problem_media': "Опишите вашу проблему и при необходимости прикрепите медиафайлы (фото, видео, голосовые сообщения): 📝📸🎥🎙️",
        'request_sent': "Ваш запрос был успешно отправлен! 🎉\n\nПожалуйста, подождите немного, пока наши менторы просмотрят вашу заявку и помогут вам решить проблему. Спасибо за ваше терпение! 🙏",
        'request_canceled': "Запрос на помощь был отменен. Если вам потребуется помощь снова, не стесняйтесь обращаться. ❌",
        'cancel': "❌ Отмена",
        'return': "🔙 Вернуться",
        'send_help_request': "✉️ Отправить запрос на помощь",
        'leave_review': '✍️ Оставить отзыв',
        'review': "Пожалуйста, оставьте ваш отзыв о помощи, которую вы получили. ✍️",
        'review_thanks': "Спасибо за ваш отзыв! 🙏",
        'review_invalid': "Пожалуйста, отправьте текстовый отзыв. ❗",
        'review_canceled': "Отзыв был отменён. Если вы захотите оставить отзыв позже, не стесняйтесь обращаться. ❌",
        'help': '🆘 Помощь',
        'help_message': 'Вот несколько советов о том, как использовать нашего бота:\n\n'
                        '1. **Выбор языка**:\n'
                        '   - Вы можете выбрать язык интерфейса бота, нажав кнопку "Выбрать язык". Бот поддерживает несколько языков, чтобы вам было удобнее общаться с ним.\n\n'
                        '2. **Запрос помощи**:\n'
                        '   - Если у вас возникли вопросы или вам нужна помощь, нажмите кнопку "Отправить запрос на помощь". Мы постараемся ответить на ваш запрос как можно быстрее.\n\n'
                         '3. **Учебные материалы**:\n'
                        '   - Наш бот предоставляет доступ к полезным учебным ресурсам через кнопку "Учебные материалы". Эта функция включает в себя:\n'
                        '     - **Ресурсы для изучения веб-разработки**: Включает материалы по HTML, CSS, JavaScript и другим технологиям.\n'
                        '     - **Учебные материалы по программированию**: Доступ к материалам по Python и другим языкам программирования.\n'
                        '     - **Инструменты и системы**: Информация о системах контроля версий и других полезных инструментах.\n\n'
                        '4. **Оставить отзыв**:\n'
                        '   - Мы ценим ваше мнение! Нажмите кнопку "Оставить отзыв", чтобы поделиться своими впечатлениями, предложениями или замечаниями. Ваши отзывы помогают нам улучшать бот и делать его более удобным для всех пользователей.\n\n'
                        'Если у вас возникли другие вопросы или предложения, не стесняйтесь обращаться к нам. Мы '
                        'всегда рады помочь!\n\n'
                        'Спасибо, что используете нашего бота!',
        'unknown_command': 'Неизвестная команда. Пожалуйста, используйте команду, поддерживаемую ботом.',
        'materials': '📚 Учебные материалы',

    },
    'en': {
        'welcome': "Welcome! 😊\n\nWe are happy to help you with any questions or problems...",
        'select_language': "🌐 Select Language",
        'enter_fullname': "Please enter your full name: 👤",
        'enter_group': "Please specify your group: 🏷️",
        'describe_problem': "Describe your problem: 📝",
        'describe_problem_media': "Describe your problem and attach media files (photos, videos, voice messages) if needed: 📝📸🎥🎙️",
        'request_sent': "Your request has been successfully sent! 🎉\n\nPlease wait a moment while our mentors review your request and assist you with your issue. Thank you for your patience! 🙏",
        'request_canceled': "Help request has been canceled. If you need assistance again, feel free to reach out. ❌",
        'cancel': "❌ Cancel",
        'return': "🔙 Return",
        'send_help_request': "✉️ Send Help Request",
        'leave_review': '✍️ Leave review',
        'review': "Please leave your feedback on the assistance you received. ✍️",
        'review_thanks': "Thank you for your feedback! 🙏",
        'review_invalid': "Please send a text review. ❗",
        'review_canceled': "The review has been canceled. If you want to leave a review later, feel free to reach out. ❌",
        'help': '🆘 Help',
        'help_message': 'Here are some tips on how to use our bot:\n\n'
                        '1. **Select Language**:\n'
                        '   - You can select the bot’s interface language by clicking the "Select Language" button. The bot supports several languages to make communication easier.\n\n'
                        '2. **Send Help Request**:\n'
                        '   - If you have questions or need help, click the "Send Help Request" button. We will try to respond to your request as quickly as possible.\n\n'
                       '3. **Materials**:\n'
                        '   - Our bot provides access to useful educational resources through the "Materials" button. This includes:\n'
                        '     - **Web Development Resources**: Includes materials on HTML, CSS, JavaScript, and other technologies.\n'
                        '     - **Programming Resources**: Access to materials on Python and other programming languages.\n'
                        '     - **Tools and Systems**: Information on version control systems and other useful tools.\n\n'
                        '4. **Leave Feedback**:\n'
                        '   - We value your opinion! Click the "Leave Feedback" button to share your impressions, suggestions, or comments. Your feedback helps us improve the bot and make it more useful for all users.\n\n'
                        'If you have other questions or suggestions, feel free to contact us. We are always happy to help!\n\n'
                        'Thank you for using our bot!',
        'unknown_command': 'Unknown command. Please use a command supported by the bot.',
        'materials': '📚 Materials',

    },
    'kgz': {
        'welcome': "Кош келиңиз! 😊\n\nБиз сизге көйгөйлөрүңүздү чечүүгө жардам берүүгө даярбыз...",
        'select_language': "🌐 Тилди тандаңыз",
        'enter_fullname': "Сураныч, толук атыңызды жазыңыз: 👤",
        'enter_group': "Сиз кайсы топто экениңизди көрсөтүңүз: 🏷️",
        'describe_problem': "Маселеңизди сүрөттөп бериңиз: 📝",
        'describe_problem_media': "Маселеңизди сүрөттөп бериңиз жана керек болсо медиа файлдарды (фото, видео, үн билдирүүлөрү) тиркеп бериңиз: 📝📸🎥🎙️",
        'request_sent': "Сиздин жардам сураганыңыз ийгиликтүү жөнөтүлдү! 🎉\n\nСуранычыңыз үчүн менторлордун жообун күтүп туруңуз. Биздин команда сизге жакын арада жардам берет. Сабырдуулугуңуз үчүн рахмат! 🙏",
        'request_canceled': "Жардам суранычыңыз жокко чыгарылды. Кайра жардам керек болсо, бизге кайрылыңыз. ❌",
        'cancel': "❌ Жокко чыгаруу",
        'return': "🔙 Кайтуу",
        'send_help_request': "✉️ Жардам суроо",
        'leave_review': '✍️ Пикир калтыруу',
        'review': "Сураныч, сиз алган жардам боюнча пикир калтырыңыз. ✍️",
        'review_thanks': "Пикириңиз үчүн рахмат! 🙏",
        'review_invalid': "Сураныч, тексттик пикир калтырыңыз. ❗",
        'review_canceled': "Пикир калтыруу токтотулду. Кийинчерээк пикир калтыргыңыз келсе, бизге кайрылыңыз. ❌",
        'help': '🆘 Жардам',
        'help_message': 'Мына биздин ботту кантип колдонууну түшүнүүгө жардам берүүчү кеңештер:\n\n'
                        '1. **Тилди тандоо**:\n'
                        '   - Боттун интерфейс тилин тандоо үчүн "Тилди тандаңыз" баскычын басыңыз. Бот көп тилдерди колдойт, бул сизге оңой сүйлөшүүгө мүмкүнчүлүк берет.\n\n'
                        '2. **Жардам суранычы**:\n'
                        '   - Сизде суроолор болсо же жардам керек болсо, "Жардам суроо" баскычын басыңыз. Биз сиздин суранычыңызга мүмкүн болушунча тез жооп берүүгө аракет кылабыз.\n\n'
                        '3. **Материалдар**:\n'
                        '   - Бот "Материалдар" баскычы аркылуу пайдалуу окуу ресурстарына кирүүгө мүмкүнчүлүк берет. Бул функция төмөнкүлөрдү камтыйт:\n'
                        '     - **Веб-Өнүктүрүү Ресурстары**: HTML, CSS, JavaScript жана башка технологиялар боюнча материалдарды камтыйт.\n'
                        '     - **Программалоо Ресурстары**: Python жана башка программалоо тилдери боюнча материалдар.\n'
                        '     - **Инструменттер жана Жүйөлөр**: Версияларды башкаруу системалары жана башка пайдалуу куралдар боюнча маалымат.\n\n'
                        '4. **Пикир калтыруу**:\n'
                        '   - Биз сиздин пикирди баалайбыз! "Пикир калтыруу" баскычын басып, өз ой-пикирлериңизди, сунуштарыңызды же комментарийлериңизди бөлүшүңүз. Сиздин пикирлер бизге ботту жакшыртууга жана аны бардык колдонуучулар үчүн ыңгайлуу кылууга жардам берет.\n\n'
                        'Башка суроолор же сунуштар болсо, биз менен байланышуудан тартынбаңыз. Биз сизге жардам берүүгө дайым даярбыз!\n\n'
                        'Биздин ботту колдонуп жатканыңыз үчүн рахмат!',
        'unknown_command': 'Белгисиз буйрук. Сураныч, бот колдойт деп эсептелген буйруктарды колдонуңуз.',
        'materials': '📚 Материалдар',
    }
}

cancel = ['❌ Жокко чыгаруу',"❌ Cancel","❌ Отмена",]
